Revit 2024 API
StructuralSectionISlopedFlange Class
 Defines parameters for I-shape Sloped Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionISlopedFlange : StructuralSectionGeneralI
Visual Basic
Public Class StructuralSectionISlopedFlange _
	Inherits StructuralSectionGeneralI
Visual C++
public ref class StructuralSectionISlopedFlange : public StructuralSectionGeneralI
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
See Also
StructuralSectionISlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace